#+title: 💸 Arbitraging Interest Rates for Fun
#+date: 2022-01-22
#+tags: arbitrage,interactive brokers,tangerine,margin loan,savings

#+begin_text-center
/Disclaimer: this is not financial advice and the strategy shown is for entertainment purposes only./
#+end_text-center

** 🔍 An Example
Using the example of taking a $25,000 margin loan at a 1.50% interest rate and depositing it at a 2.50% interest rate:
#+begin_src ruby :exports both
25000 * (0.025-0.015)
#+end_src

#+RESULTS:
: 250

The gain would be $250 over an entire year. Tangerine bonus rates usually only last for a few months, so you would have to divide by 12 and multiply by the number of months you have a promo rate that's higher than the Interactive Brokers margin rate. For example for 3 months of promo rate:
#+begin_src ruby :exports both
250 / 12 * 3
#+end_src

#+RESULTS:
: 60

So $60 over 3 months for borrowing $25,000... Would it be worth it for you?

Know that this is a volume's game: the more you borrow, the smaller the margin interest Interactive Brokers would charge you,
and the higher interest you would get from Tangerine (or any other bank offering a high-interest savings account).

/(Please note Tangerine has a $1,000,000 limit on their bonus interest rate and stops paying bonus interest rate above that.)/

